docs/2016/emacs-web-development-environment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2025-01-19 日 16:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs 24 で Web 開発の環境を作る</title>
<meta name="author" content="clothoid" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://clothoid.github.io/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://clothoid.github.io/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">emacs 24 で Web 開発の環境を作る</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdad9cb1">1. 環境</a></li>
<li><a href="#org90dbeb4">2. emmet-mode</a></li>
<li><a href="#org8b8423b">3. web-mode</a></li>
<li><a href="#org0473a57">4. js2-mode</a></li>
<li><a href="#org34086b0">5. MozRepl + moz.el</a></li>
<li><a href="#orgc634bee">6. flycheck</a></li>
<li><a href="#org546abc0">7. nxml-mode</a></li>
<li><a href="#org44c742e">8. json-mode</a></li>
<li><a href="#orgcf2b516">9. 参考</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdad9cb1" class="outline-2">
<h2 id="orgdad9cb1"><span class="section-number-2">1.</span> 環境</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Windows 7 64bit</li>
<li>gnupack _ devel-13.06-2015.11.08
<ul class="org-ul">
<li>xmllint: /usr/bin/xmllint: using libxml version 20902 compiled with: Threads Tree Output Push Reader Patterns Writer SAXv1 FTP HTTP DTDValid HTML Legacy C14N Catalog XPath XPointer XInclude Iconv ISO8859X Unicode Regexps Automata Expr Schemas Schematron Modules Debug Zlib Lzma</li>
</ul></li>
<li>GNU Emacs 24.5.1 (i686-pc-cygwin) of 2015-11-08 on gnupack
<ul class="org-ul">
<li>emmet-mode-20151213.738</li>
<li>web-mode-20160323.1550</li>
<li>js2-mode-20160326.1758</li>
<li>moz-20150805.1006</li>
<li>moz-controller-20141001.2347</li>
</ul></li>
<li>Waterfox 44.03</li>
<li>Node.js v5.9.1</li>
</ul>
</div>
</div>
<div id="outline-container-org90dbeb4" class="outline-2">
<h2 id="org90dbeb4"><span class="section-number-2">2.</span> emmet-mode</h2>
<div class="outline-text-2" id="text-2">
<p>
HTML や CSS を簡単に記述できる emmet 記法を emacs 上で使用するもの <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>。
</p>
<pre class="example" id="org5c2294e">
M-x package-install emmet-mode
</pre>
<p>
init.el は以下のような感じ。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'emmet-mode)
(add-hook 'web-mode-hook 'emmet-mode)
;; (eval-after-load "emmet-mode"
;;   '(define-key emmet-mode-keymap (kbd "C-j") nil)) ;; C-j は newline のままにしておく
(add-hook 'emmet-mode-hook (lambda () (setq emmet-indentation 2)))
(define-key emmet-mode-keymap (kbd "C-&lt;return&gt;") 'emmet-expand-line)
</pre>
</div>
<p>
使い方は、例えば、html ファイルを開いて
</p>
<div class="org-src-container">
<pre class="src src-html">a+b
</pre>
</div>
<p>
として、C-&lt;return&gt; すると
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;a href=""&gt;&lt;/a&gt;
&lt;b&gt;&lt;/b&gt;
</pre>
</div>
<p>
と展開されるような感じ。より詳しく学ぶためには <a href="http://dotinstall.com/lessons/basic_emmet">Emmet/Zen-coding 入門 (全 10 回) - プログラミングならドットインストール</a>をやるといいかも。
</p>
</div>
</div>

<div id="outline-container-org8b8423b" class="outline-2">
<h2 id="org8b8423b"><span class="section-number-2">3.</span> web-mode</h2>
<div class="outline-text-2" id="text-3">
<p>
HTML、JavaScript、CSS、PHP、JSP、Twig、Jinja2、ASPX、ERB、FreeMarker 包括的にサポートする環境。
</p>
<pre class="example" id="org4c6505d">
M-x package-install web-mode
</pre>
<p>
init.el は以下のような感じ。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'web-mode)
;; *.phtml, *.html, *.htm, *.tpl.php, *.jsp, *.ascx, *.aspx, *.erb
(add-to-list 'auto-mode-alist '("\\.p?html?\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.jsp\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
;; なぜか C-;に C-c C-;と同じ機能が割り当てられてるので削除する
(define-key web-mode-map (kbd "C-;") nil)
;;; 
(add-hook 'web-mode-hook 'rainbow-mode)
</pre>
</div>
<p>
さらに、org-mode と合わせるよう、以下のように設定している。
</p>
<pre class="example" id="orga630fbb">
M-x package-install smartrep
</pre>
<p>
init.el は以下のように。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'smartrep)
(smartrep-define-key web-mode-map "C-c"
  '(("C-p" . web-mode-parent-element)
    ("C-n" . web-mode-match-tag)
    ("C-l" . web-mode-previous-element)
    ("C-m" . web-mode-mark-and-expand)))
</pre>
</div>
<p>
使い方は、例えば、タグ内で C-c C-p とすれば開始タグに移動するといったもの。
</p>
</div>
</div>
<div id="outline-container-org0473a57" class="outline-2">
<h2 id="org0473a57"><span class="section-number-2">4.</span> js2-mode</h2>
<div class="outline-text-2" id="text-4">
<p>
超強力な JavaScript のモード。
</p>
<pre class="example" id="orgbbab0d3">
M-x package-install js2-mode
</pre>
<p>
init.el は以下のような感じ。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'js2-mode)
(add-to-list 'auto-mode-alist '("\\.js$" . js2-mode))
(add-to-list 'auto-mode-alist '("\\.jsx\\'" . js2-jsx-mode))
</pre>
</div>
<p>
使い方は javascript を書きまくっていけば分かるはず。。。
</p>
</div>
</div>
<div id="outline-container-org34086b0" class="outline-2">
<h2 id="org34086b0"><span class="section-number-2">5.</span> MozRepl + moz.el</h2>
<div class="outline-text-2" id="text-5">
<p>
MozRepl は telnet 経由で Mozilla ベースのブラウザ(firefox や waterfox など)を操作するアドオン。
</p>
<ol class="org-ol">
<li><a href="https://addons.mozilla.org/en-US/firefox/addon/mozrepl/">mozrepl</a> を インストール</li>
<li>ブラウザを再起動</li>
<li>[F10] を押す</li>
<li>[Tools] &gt; [MozRepl] &gt; [Activate on startup]</li>
<li>ブラウザを再起動</li>
</ol>

<p>
moz.el は MozRepl と連携をとるもの。
</p>
<pre class="example" id="orgdebc2f4">
M-x package-install moz.el
</pre>

<p>
init.el は以下のような感じ。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'moz)
(add-hook 'js2-mode-hook 'moz-minor-mode)

;;; リロードの設定
(defun reload-firefox-if-local ()
  (interactive)
  (comint-send-string
    (inferior-moz-process)
    "if (content.location.host == \"localhost\" || content.location.host == \"\") { BrowserReload(); }"))
</pre>
</div>

<p>
使い方は例えば、jstest.html として以下のものを用意しておいて、MozRepl を入れたブラウザで開き、
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;html&gt;
    &lt;head&gt;
  	&lt;title&gt;sample&lt;/title&gt;
    &lt;/head&gt;
    &lt;body&gt;
  	&lt;script src="./jstest.js" type="text/javascript"&gt;&lt;/script&gt;
    &lt;/body&gt;
&lt;/html&gt;
</pre>
</div>
<p>
test.js として、同じ場所に、以下のような内容で用意しておいて、
</p>
<div class="org-src-container">
<pre class="src src-js">document.write("Hello, World!");
</pre>
</div>
<p>
Hello, World! の文字列を適当に変えた後、M-x reload-firefox-if-local とすると自動でブラウザ表示が更新される<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>。
</p>
</div>
</div>

<div id="outline-container-orgc634bee" class="outline-2">
<h2 id="orgc634bee"><span class="section-number-2">6.</span> flycheck</h2>
<div class="outline-text-2" id="text-6">
<p>
構文チェックツール。
</p>
<pre class="example" id="org79c1891">
M-x package-install flycheck
</pre>
</div>
</div>
<div id="outline-container-org546abc0" class="outline-2">
<h2 id="org546abc0"><span class="section-number-2">7.</span> nxml-mode</h2>
<div class="outline-text-2" id="text-7">
<p>
nxml-mode はデフォルトで入っている。構文チェックツールとして cygwin の xmllint を使う。
</p>
<div class="org-src-container">
<pre class="src src-sh">$ apt-cyg install libxml2
$ xmllint --version
/usr/bin/xmllint: using libxml version 20902
   compiled with: Threads Tree Output Push Reader Patterns Writer SAXv1 FTP HTTP DTDValid HTML Legacy C14N Catalog XPath XPointer XInclude Iconv ISO8859X Unicode Regexps Automata Expr Schemas Schematron Modules Debug Zlib Lzma 
</pre>
</div>
<p>
init.el は以下のような感じ。smartrep は web-mode と同じ感じに。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'nxml-mode)
(add-to-list 'auto-mode-alist '("\\.xml$" . nxml-mode))
(add-hook 'nxlm-mode-hook #'flycheck-mode)
(add-hook 'nxlm-mode-hook 'emmet-mode)
(require 'smartrep)
(smartrep-define-key nxml-mode-map "C-c"
  '(("C-p" . nxml-backward-element)
    ("C-n" . nxml-forward-element) 	; デフォルトは rng-next-error
    ("C-u" . nxml-up-element)
    ("C-d" . nxml-down-element)
    ))
</pre>
</div>
</div>
</div>
<div id="outline-container-org44c742e" class="outline-2">
<h2 id="org44c742e"><span class="section-number-2">8.</span> json-mode</h2>
<div class="outline-text-2" id="text-8">
<p>
json-mode を入れる。
</p>
<pre class="example" id="org91e6e57">
M-x package-install json-mode
</pre>

<p>
init.el は以下のような感じ。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'json-mode)
(add-to-list 'auto-mode-alist '("\\.json$" . json-mode))
</pre>
</div>

<p>
構文チェックツールとして、Windows の node.js に入っている jsonlint を使うため <a href="https://nodejs.org/en/">Node.js</a> からダウンロードしてインストール。
その後、PATH を設定して動作確認する。
</p>
<div class="org-src-container">
<pre class="src src-sh">$ export PATH=$PATH:/home/clothoid/node_modules/.bin/jsonlint
$ which jsonlint
/home/clothoid/node_modules/.bin/jsonlint
$ jsonlint --version
1.6.2
</pre>
</div>

<p>
使い方は以下のような感じ<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>。
</p>

<div class="org-src-container">
<pre class="src src-sh">$ cat 2016-03-31-191947.json
[{ "name":"clothoid", "favarite":["kashima antlers" "emacs"]},]
$ jsonlint 2016-03-31-191947.json
[Error: Parse error on line 1:
...:["kashima antlers" "emacs"]},]
-----------------------^
Expecting 'EOF', '}', ':', ',', ']', got 'STRING']
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf2b516" class="outline-2">
<h2 id="orgcf2b516"><span class="section-number-2">9.</span> 参考</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li><a href="http://catcher-in-the-tech.net/55/">Emacs の便利な設定 - Catcher in the tech</a></li>
<li><a href="http://qiita.com/ironsand/items/55f2ced218949efbb1fb">Emacs に zen-coding の後継の Emmet mode を入れる - Qiita</a></li>
<li><a href="https://github.com/smihica/emmet-mode">GitHub - smihica/emmet-mode: emmet's support for emacs.</a></li>
<li><a href="http://dotinstall.com/lessons/basic_emmet">Emmet/Zen-coding 入門 (全 10 回) - プログラミングならドットインストール</a></li>
<li><a href="http://daifuku-p.org/w/?p=830">emacs に js2-mode をインストールする． | ~Daifuku-p</a></li>
<li><a href="https://sites.google.com/site/shidoinfo/Home/programing-lang/%E9%96%A2%E6%95%B0%E5%9E%8B%E3%83%97%E3%83%AD%E3%82%B0%E3%83%A9%E3%83%9F%E3%83%B3%E3%82%B0%E8%A8%80%E8%AA%9E/ecmascript/javascript-kai-fa-huan-jing/emacs-javascript/js2-mode">js2-mode - 紫藤の Wiki</a></li>
<li><a href="http://drumken.blog8.fc2.com/blog-entry-360.html">zencoding-mode 後継の emmet-mode が便利 - Code &amp; Note</a></li>
<li><a href="http://catcher-in-the-tech.net/55/">Emacs の便利な設定 - Catcher in the tech</a></li>
<li><a href="http://cortyuming.hateblo.jp/entry/2015/11/05/174929">Emacs で React の jsx を js2-mode で書けるようになってたメモ - 牌語備忘録 -pygo</a></li>
<li><a href="http://proshunsuke.hatenablog.com/entry/2016/03/22/023126">js2-jsx-mode で auto-complete を有効にする - エンジニアになりたい</a></li>
<li><a href="http://qiita.com/mysticatea/items/f523dab04a25f617c87d">ESLint 最初の一歩 - Qiita</a></li>
<li><a href="http://qiita.com/noriaki/items/8122e83867ff0cdb5d13">flycheck を特定のモードでだけ有効にする - Qiita</a></li>
<li><a href="http://yak-shaver.blogspot.com/2013/06/emacs-json-flymake.html">Emacs で JSON を Flymake する | The Yak Shaver</a></li>
<li><a href="http://syohex.hatenablog.com/entry/20130123/1358950322">flymake の設定する前に flycheck を確認しよう - syohex ’ s diary</a></li>
<li><a href="http://fukuyama.co/?p=4589">Emacs で xhtml と html5 の flymake をトグル - Web 学び</a></li>
<li><a href="http://codewinds.com/blog/2015-04-02-emacs-flycheck-eslint-jsx.html">Configuring emacs to use eslint and babel with flycheck for javascript and React.js JSX | CodeWinds</a></li>
<li><a href="http://qiita.com/takaxp/items/73d9f2fbd15debe1ce2c">init.el マッチョ化進行中 - Qiita</a></li>
<li><a href="http://qiita.com/tt2004d/items/2ea1af8bfd324585dd07">JSON Lint をつかって文法チェック - Qiita</a></li>
<li><a href="http://yak-shaver.blogspot.com/2013/06/json-lint.html">コマンドラインで使える JSON Lint | The Yak Shaver</a></li>
<li><a href="http://syohex.hatenablog.com/entry/20150304/1425447271">json の validation - syohex ’ s diary</a></li>
<li><a href="http://nkenbou.hatenablog.com/entry/2015/05/04/150434">Cygwin 版 Emacs の flycheck (JSHint) で JavaScript のシンタックスチェックをする - nkenbou のはまり日記</a></li>
</ul>

<div class="HTML" id="orgb1b6781">
<p>
&lt;a href="<a href="https://twitter.com/share">https://twitter.com/share</a>" class="twitter-share-button" data-via="clothoid" data-size="large"&gt;Tweet&lt;/a&gt;
&lt;script&gt;!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');&lt;/script&gt;
</p>

</div>

<div class="HTML" id="org5e7b9a6">
<p>
&lt;script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"&gt;&lt;/script&gt;
&lt;!&#x2013; responsive &#x2013;&gt;
&lt;ins class="adsbygoogle"
     style="display:block"
     data-ad-client="ca-pub-6390292679676181"
     data-ad-slot="9831612556"
     data-ad-format="auto"&gt;&lt;/ins&gt;
&lt;script&gt;
(adsbygoogle = window.adsbygoogle || []).push({});
&lt;/script&gt;
</p>

</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
これの古いものに zencoding-mode というものがある。
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
after-save-hook に reload-firefox-if-local を add-hook するような設定もよくある。昔、これをやって、org-html-export-to-html や org-html-export-as-html で以下のようなエラーが出てハマッたことがあったから、使ってない。reload-firefox-if-local をどこかのキーバインドに割り当てて使うのがいいと思う。
</p>
<pre class="example" id="org286d141">
Can't start MozRepl, the error message was:

     make client process failed: connection refused, :name, MozRepl, :buffer, *MozRepl*, :host, localhost, :service, 4242, :nowait, nil

A possible reason is that you have not installed
the MozRepl add-on to Firefox or that you have not
started it.  You start it from the menus in Firefox:

     Tools / MozRepl / Start

See MozRepl home page for more information.

MozRepl is also available directly from Firefox add-on
pages, but is updated less frequently there.
</pre></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
(add-hook 'json-mode-hook #'flycheck-mode) としたいところだけど、以下のエラーが出る。この理由はコレ→ <a href="http://nkenbou.hatenablog.com/entry/2015/05/04/150434">Cygwin 版 Emacs の flycheck (JSHint) で JavaScript のシンタックスチェックをする - nkenbou のはまり日記</a>
</p>

<pre class="example" id="org37f622c">
Error: ENOENT: no such file or directory, open 'E:\c\temp\gnupack\flycheck7352doC\2016-03-31-191947.json'
    at Error (native)
    at Object.fs.openSync (fs.js:584:18)
    at Object.fs.readFileSync (fs.js:431:33)
    at main (E:\home\clothoid\node_modules\jsonlint\lib\cli.js:135:23)
    at Object.&lt;anonymous&gt; (E:\home\clothoid\node_modules\jsonlint\lib\cli.js:179:1)
    at Module._compile (module.js:413:34)
    at Object.Module._extensions..js (module.js:422:10)
    at Module.load (module.js:357:32)
    at Function.Module._load (module.js:314:12)
    at Function.Module.runMain (module.js:447:10)
</pre></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: clothoid</p>
<p class="date">Created: 2025-01-19 日 16:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
